danielvie/doutorado/embedded/esp32_idf/main/src/helper_analog.cpp
#include "helper_analog.h"
#include <atomic>
#include <cstdint>
#include <cstring>
#include <cstdio>

#include "helper_common.h"
#include "esp_adc/adc_continuous.h"
#include "esp_cpu.h"
#include "esp_rom_sys.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "soc/soc_caps.h"

#define LATENCY_WINDOW_SIZE 128
#define ANALOG_TARGET_TRIPLES_PER_CYCLE 4
#define ANALOG_ADC_MAX_CODE 4095
#define ADC_CONTINUOUS_FRAME_TRIPLES 16
#define ADC_CONTINUOUS_FRAME_SIZE (SOC_ADC_DIGI_RESULT_BYTES * 3 * ADC_CONTINUOUS_FRAME_TRIPLES)
#define ADC_CONTINUOUS_STORE_SIZE (ADC_CONTINUOUS_FRAME_SIZE * 4)
// Yield periodically so the analog task does not starve IDLE0 and trip WDT.
#define ADC_CONTINUOUS_FRAMES_PER_IDLE_DELAY 32
// DMA can deliver channel groups unevenly; per-channel queues let us rebuild
// complete AN3/AN5/AN6 triples without trusting sample order.
#define ANALOG_DMA_CHANNEL_QUEUE_SIZE 64
// One timestamp per completed DMA frame, produced in ISR and consumed by the
// acquisition task; sized above the driver store depth (4 frames).
#define ANALOG_FRAME_TS_RING_SIZE 8
// Seqlock retry bounds. The control point must never spin unbounded on Core 1
// waiting for the Core-0 writer; giving up is a recoverable missed update.
#define ANALOG_CONTROL_SEQLOCK_RETRIES 8
#define ANALOG_STATUS_SEQLOCK_RETRIES 256

#if (SOC_ADC_DIGI_RESULT_BYTES == 2)
#define ADC_CONTINUOUS_OUTPUT_FORMAT ADC_DIGI_OUTPUT_FORMAT_TYPE1
#define ADC_CONTINUOUS_GET_CHANNEL(sample) ((sample)->type1.channel)
#define ADC_CONTINUOUS_GET_DATA(sample) ((sample)->type1.data)
#else
#define ADC_CONTINUOUS_OUTPUT_FORMAT ADC_DIGI_OUTPUT_FORMAT_TYPE2
#define ADC_CONTINUOUS_GET_CHANNEL(sample) ((sample)->type2.channel)
#define ADC_CONTINUOUS_GET_DATA(sample) ((sample)->type2.data)
#endif

static uint32_t s_latency_buffer[LATENCY_WINDOW_SIZE] = {0};
static std::atomic<size_t> s_latency_index(0);

struct AnalogSnapshotStorage {
    std::atomic<bool> valid{false};
    std::atomic<uint64_t> timestamp_us{0};
    std::atomic<uint32_t> raw_an3{0};
    std::atomic<uint32_t> raw_an5{0};
    std::atomic<uint32_t> raw_an6{0};
    std::atomic<float> calibrated_an3{0.0f};
    std::atomic<float> calibrated_an5{0.0f};
    std::atomic<float> calibrated_an6{0.0f};
};

struct AnalogSnapshotCopy {
    bool valid = false;
    uint64_t timestamp_us = 0;
    uint32_t raw_an3 = 0;
    uint32_t raw_an5 = 0;
    uint32_t raw_an6 = 0;
    float calibrated_an3 = 0.0f;
    float calibrated_an5 = 0.0f;
    float calibrated_an6 = 0.0f;
};

static std::atomic<uint32_t> s_snapshot_seq(0);
static AnalogSnapshotStorage s_snapshot;
static std::atomic<uint32_t> s_measured_triples_per_second(0);
static std::atomic<uint32_t> s_rate_window_triples(0);
static std::atomic<uint64_t> s_rate_window_start_us(0);
static std::atomic<uint32_t> s_overflow_count(0);
static std::atomic<uint32_t> s_miss_count(0);
static std::atomic<uint32_t> s_consecutive_misses(0);
static std::atomic<uint32_t> s_fault_code(0);
static std::atomic<uint32_t> s_samples_read(0);
static std::atomic<uint32_t> s_samples_rejected(0);
static std::atomic<uint32_t> s_channel_order_anomalies(0);
static std::atomic<uint32_t> s_partial_triples(0);
static std::atomic<uint32_t> s_frame_drops(0);
static std::atomic<uint32_t> s_pool_flushes(0);
static std::atomic<uint32_t> s_dma_channel_counts[8];
static std::atomic<uint32_t> s_dma_channel_last_raw[8];
static std::atomic<bool> s_calibration_lut_ready(false);
static float s_calibration_lut[ANALOG_ADC_MAX_CODE + 1] = {0.0f};

static adc_continuous_handle_t s_adc_continuous_handle = NULL;
static bool s_adc_continuous_started = false;
static uint32_t s_adc_continuous_sample_hz = 0;
static uint32_t s_adc_continuous_frames_since_delay = 0;

// Frame-completion timestamps captured in the DMA ISR. Single producer (ISR)
// and single consumer (acquisition task), so head/tail indices suffice.
static volatile uint64_t s_frame_ts_ring[ANALOG_FRAME_TS_RING_SIZE];
static std::atomic<uint32_t> s_frame_ts_write(0);
static std::atomic<uint32_t> s_frame_ts_read(0);

static void analog_publish_compat(uint32_t raw_an3, float an3,
                                  uint32_t raw_an5, float an5,
                                  uint32_t raw_an6, float an6,
                                  uint64_t sample_timestamp_us,
                                  bool valid);

static bool IRAM_ATTR analog_on_conv_done(adc_continuous_handle_t handle,
                                          const adc_continuous_evt_data_t* edata,
                                          void* user_data) {
    uint32_t write = s_frame_ts_write.load(std::memory_order_relaxed);
    uint32_t read = s_frame_ts_read.load(std::memory_order_acquire);
    if (write - read < ANALOG_FRAME_TS_RING_SIZE) {
        s_frame_ts_ring[write % ANALOG_FRAME_TS_RING_SIZE] = (uint64_t)esp_timer_get_time();
        s_frame_ts_write.store(write + 1, std::memory_order_release);
    }
    return false;
}

static void analog_frame_ts_clear() {
    s_frame_ts_read.store(s_frame_ts_write.load(std::memory_order_acquire),
                          std::memory_order_release);
}

// Pops the completion timestamp of the oldest pending frame; frames are read
// from the driver in FIFO order so timestamps pair one-to-one. If the ring
// desynchronizes (dropped frames, flush) the caller resyncs via
// analog_frame_ts_clear and falls back to read time.
static uint64_t analog_frame_ts_pop(uint64_t fallback_us) {
    uint32_t read = s_frame_ts_read.load(std::memory_order_relaxed);
    uint32_t write = s_frame_ts_write.load(std::memory_order_acquire);
    if (write == read) {
        return fallback_us;
    }
    uint64_t ts = s_frame_ts_ring[read % ANALOG_FRAME_TS_RING_SIZE];
    s_frame_ts_read.store(read + 1, std::memory_order_release);
    return ts;
}

void analog_record_latency(uint32_t us) {
    // Lock-free increment and wrap
    size_t idx = s_latency_index.fetch_add(1, std::memory_order_relaxed) % LATENCY_WINDOW_SIZE;
    s_latency_buffer[idx] = us;
}

void analog_record_overflow() {
    s_overflow_count.fetch_add(1, std::memory_order_acq_rel);
    s_fault_code.store(ANALOG_FAULT_DMA_OVERFLOW, std::memory_order_release);
}

