danielvie/doutorado/embedded/esp32_idf/main/src/helper_analog.cpp
void analog_record_miss(uint32_t fault_code) {
    uint32_t misses = s_consecutive_misses.fetch_add(1, std::memory_order_acq_rel) + 1;
    s_miss_count.fetch_add(1, std::memory_order_acq_rel);
    s_fault_code.store(misses >= 3 ? ANALOG_FAULT_REPEATED_MISS : fault_code,
                       std::memory_order_release);
}

void analog_get_latency_stats(uint32_t* min, uint32_t* max, uint32_t* avg) {
    uint32_t current_min = 0xFFFFFFFF;
    uint32_t current_max = 0;
    uint64_t sum = 0;
    uint32_t count = 0;

    // Scan the window (On-demand math)
    for (int i = 0; i < LATENCY_WINDOW_SIZE; i++) {
        uint32_t val = s_latency_buffer[i];
        if (val == 0) continue; // Skip uninitialized slots
        
        if (val < current_min) current_min = val;
        if (val > current_max) current_max = val;
        sum += val;
        count++;
    }

    if (count > 0) {
        *min = current_min;
        *max = current_max;
        *avg = (uint32_t)(sum / count);
    } else {
        *min = 0; *max = 0; *avg = 0;
    }
}

static uint32_t analog_latency_p95() {
    uint32_t values[LATENCY_WINDOW_SIZE];
    uint32_t count = 0;

    for (int i = 0; i < LATENCY_WINDOW_SIZE; i++) {
        uint32_t val = s_latency_buffer[i];
        if (val != 0) {
            values[count++] = val;
        }
    }

    if (count == 0) {
        return 0;
    }

    for (uint32_t i = 1; i < count; i++) {
        uint32_t value = values[i];
        int j = i - 1;
        while (j >= 0 && values[j] > value) {
            values[j + 1] = values[j];
            j--;
        }
        values[j + 1] = value;
    }

    uint32_t index = ((count * 95) + 99) / 100;
    if (index == 0) {
        index = 1;
    }
    return values[index - 1];
}

// Report rate over a full window; per-sample deltas are too noisy for
// judging DMA stability from the dashboard.
static void analog_rate_record_triple(uint64_t now_us) {
    uint64_t window_start = s_rate_window_start_us.load(std::memory_order_acquire);
    if (window_start == 0) {
        s_rate_window_start_us.store(now_us, std::memory_order_release);
        s_rate_window_triples.store(0, std::memory_order_release);
    } else {
        uint32_t triples = s_rate_window_triples.fetch_add(1, std::memory_order_acq_rel) + 1;
        uint64_t elapsed_us = now_us - window_start;
        if (elapsed_us >= 1000000ULL) {
            s_measured_triples_per_second.store(
                (uint32_t)((triples * 1000000ULL) / elapsed_us),
                std::memory_order_release);
            s_rate_window_triples.store(0, std::memory_order_release);
            s_rate_window_start_us.store(now_us, std::memory_order_release);
        }
    }
}

void analog_publish_triple(uint32_t raw_an3, float calibrated_an3,
                           uint32_t raw_an5, float calibrated_an5,
                           uint32_t raw_an6, float calibrated_an6,
                           uint64_t sample_timestamp_us,
                           bool valid) {
    uint64_t now_us = (uint64_t)esp_timer_get_time();
    if (valid) {
        analog_rate_record_triple(now_us);
    }
    // The snapshot carries the conversion time, not the publish time, so
    // measurement-age checks reflect when the signal was actually sampled.
    if (sample_timestamp_us == 0 || sample_timestamp_us > now_us) {
        sample_timestamp_us = now_us;
    }

    // Odd seq marks "writer active"; even seq below marks a coherent snapshot.
    s_snapshot_seq.fetch_add(1, std::memory_order_acq_rel);
    s_snapshot.raw_an3.store(raw_an3, std::memory_order_relaxed);
    s_snapshot.raw_an5.store(raw_an5, std::memory_order_relaxed);
    s_snapshot.raw_an6.store(raw_an6, std::memory_order_relaxed);
    s_snapshot.calibrated_an3.store(calibrated_an3, std::memory_order_relaxed);
    s_snapshot.calibrated_an5.store(calibrated_an5, std::memory_order_relaxed);
    s_snapshot.calibrated_an6.store(calibrated_an6, std::memory_order_relaxed);
    s_snapshot.timestamp_us.store(sample_timestamp_us, std::memory_order_relaxed);
    s_snapshot.valid.store(valid, std::memory_order_relaxed);

    if (valid) {
        s_consecutive_misses.store(0, std::memory_order_release);
        s_fault_code.store(0, std::memory_order_release);
    } else {
        analog_record_miss(ANALOG_FAULT_MISSING_TRIPLE);
    }

    s_snapshot_seq.fetch_add(1, std::memory_order_acq_rel);
}

// Bounded seqlock read. Returns false if a coherent snapshot could not be
// captured within max_attempts; callers must treat that as "no data" instead
// of spinning, so a preempted Core-0 writer can never stall the Core-1
// control point indefinitely.
static bool analog_snapshot_try_read(AnalogSnapshotCopy* out, uint32_t* seq_out,
                                     uint32_t max_attempts) {
    for (uint32_t attempt = 0; attempt < max_attempts; ++attempt) {
        uint32_t seq_start = s_snapshot_seq.load(std::memory_order_acquire);
        if ((seq_start & 1U) != 0) {
            continue;
        }
        out->valid = s_snapshot.valid.load(std::memory_order_relaxed);
        out->timestamp_us = s_snapshot.timestamp_us.load(std::memory_order_relaxed);
        out->raw_an3 = s_snapshot.raw_an3.load(std::memory_order_relaxed);
        out->raw_an5 = s_snapshot.raw_an5.load(std::memory_order_relaxed);
        out->raw_an6 = s_snapshot.raw_an6.load(std::memory_order_relaxed);
        out->calibrated_an3 = s_snapshot.calibrated_an3.load(std::memory_order_relaxed);
        out->calibrated_an5 = s_snapshot.calibrated_an5.load(std::memory_order_relaxed);
        out->calibrated_an6 = s_snapshot.calibrated_an6.load(std::memory_order_relaxed);
        uint32_t seq_end = s_snapshot_seq.load(std::memory_order_acquire);
        if (seq_start == seq_end && (seq_end & 1U) == 0) {
            *seq_out = seq_end;
            return true;
        }
    }
    return false;
}

void analog_get_status(AnalogRuntimeStatus* status) {
    if (status == nullptr) {
        return;
    }

    uint32_t min_us, max_us, avg_us;
    analog_get_latency_stats(&min_us, &max_us, &avg_us);

    AnalogSnapshotCopy snapshot = {};
    uint32_t seq_end = 0;
    if (!analog_snapshot_try_read(&snapshot, &seq_end, ANALOG_STATUS_SEQLOCK_RETRIES)) {
        snapshot = {};
        seq_end = s_snapshot_seq.load(std::memory_order_acquire);
    }

    uint64_t timestamp_us = snapshot.timestamp_us;
    uint64_t now_us = (uint64_t)esp_timer_get_time();
    uint64_t age_us = (timestamp_us > 0 && now_us >= timestamp_us) ? now_us - timestamp_us : 0;

    std::memset(status, 0, sizeof(*status));
    status->seq = seq_end / 2U;
    status->valid = snapshot.valid;
    status->timestamp_us = timestamp_us;
    status->age_us = (age_us > UINT32_MAX) ? UINT32_MAX : (uint32_t)age_us;
    status->target_triples_per_cycle = ANALOG_TARGET_TRIPLES_PER_CYCLE;
    status->measured_triples_per_second = s_measured_triples_per_second.load(std::memory_order_acquire);
    status->raw_an3 = snapshot.raw_an3;
    status->raw_an5 = snapshot.raw_an5;
    status->raw_an6 = snapshot.raw_an6;
    status->calibrated_an3 = snapshot.calibrated_an3;
    status->calibrated_an5 = snapshot.calibrated_an5;
    status->calibrated_an6 = snapshot.calibrated_an6;
    status->latency_min_us = min_us;
    status->latency_avg_us = avg_us;
    status->latency_p95_us = analog_latency_p95();
    status->latency_max_us = max_us;
    status->overflow_count = s_overflow_count.load(std::memory_order_acquire);
    status->miss_count = s_miss_count.load(std::memory_order_acquire);
    status->consecutive_misses = s_consecutive_misses.load(std::memory_order_acquire);
    status->fault_code = s_fault_code.load(std::memory_order_acquire);
    status->acquisition_mode = g_analog_acquisition_mode;
    status->samples_read = s_samples_read.load(std::memory_order_acquire);
    status->samples_rejected = s_samples_rejected.load(std::memory_order_acquire);
    status->channel_order_anomalies = s_channel_order_anomalies.load(std::memory_order_acquire);
    status->partial_triples = s_partial_triples.load(std::memory_order_acquire);
    status->frame_drops = s_frame_drops.load(std::memory_order_acquire);
    status->pool_flushes = s_pool_flushes.load(std::memory_order_acquire);
    status->calibration_lut_ready = s_calibration_lut_ready.load(std::memory_order_acquire);
}

