danielvie/doutorado/embedded/esp32_idf/main/src/helper_analog.cpp
uint32_t analog_get_consecutive_misses(void) {
    return s_consecutive_misses.load(std::memory_order_acquire);
}

uint32_t analog_min_snapshot_age_us(void) {
    if (g_analog_acquisition_mode != ANALOG_ACQ_MODE_CONTINUOUS) {
        // Oneshot publishes one triple per acquisition period; anything
        // fresher than two periods is physically unavailable.
        return g_analog_acquisition_period_us * 2;
    }
    uint32_t sample_hz = s_adc_continuous_sample_hz != 0 ? s_adc_continuous_sample_hz
                                                         : g_analog_continuous_sample_hz;
    if (sample_hz == 0) {
        return 0;
    }
    // One full DMA frame of accumulation plus 50% scheduling margin.
    uint32_t frame_us = (uint32_t)(((uint64_t)ADC_CONTINUOUS_FRAME_TRIPLES * 3 * 1000000ULL) / sample_hz);
    return frame_us + frame_us / 2;
}

// Control-point read path: seqlock snapshot only. Latency statistics and the
// p95 sort stay on the telemetry path (analog_get_status) so this cannot eat
// into the maintenance interval between signal cycles.
bool analog_read_control_snapshot(AnalogControlSnapshot* snapshot,
                                  uint32_t last_seq,
                                  uint32_t max_age_us) {
    if (snapshot == nullptr) {
        return false;
    }

    if (!s_calibration_lut_ready.load(std::memory_order_acquire)) {
        analog_record_miss(ANALOG_FAULT_CALIBRATION_UNAVAILABLE);
        return false;
    }

    AnalogSnapshotCopy copy = {};
    uint32_t seq_raw = 0;
    if (!analog_snapshot_try_read(&copy, &seq_raw, ANALOG_CONTROL_SEQLOCK_RETRIES)) {
        analog_record_miss(ANALOG_FAULT_SNAPSHOT_CONTENTION);
        return false;
    }
    if (!copy.valid) {
        analog_record_miss(ANALOG_FAULT_MISSING_TRIPLE);
        return false;
    }

    uint64_t now_us = (uint64_t)esp_timer_get_time();
    uint64_t age_us = (copy.timestamp_us > 0 && now_us >= copy.timestamp_us)
                          ? now_us - copy.timestamp_us
                          : 0;

    // The caller passes the signal cycle window as the age budget, but the
    // pipeline cannot deliver samples fresher than one DMA frame; clamp so
    // short cycles do not reject every sample structurally.
    uint32_t min_age_us = analog_min_snapshot_age_us();
    uint64_t effective_max_age_us = (max_age_us > min_age_us) ? max_age_us : min_age_us;

    // Control must act on a new sample inside the current timing budget; stale
    // or repeated ADC data can drive corrections in the wrong direction.
    uint32_t seq = seq_raw / 2U;
    if (seq == last_seq || age_us > effective_max_age_us) {
        analog_record_miss(ANALOG_FAULT_STALE_SAMPLE);
        return false;
    }

    snapshot->seq = seq;
    snapshot->age_us = (age_us > UINT32_MAX) ? UINT32_MAX : (uint32_t)age_us;
    snapshot->an3 = copy.calibrated_an3;
    snapshot->an5 = copy.calibrated_an5;
    snapshot->an6 = copy.calibrated_an6;
    return true;
}

std::string analog_get_dma_debug_json() {
    char json[512];
    std::snprintf(json, sizeof(json),
                  "{\"c0\":%lu,\"r0\":%lu,"
                  "\"c1\":%lu,\"r1\":%lu,"
                  "\"c2\":%lu,\"r2\":%lu,"
                  "\"c3\":%lu,\"r3\":%lu,"
                  "\"c4\":%lu,\"r4\":%lu,"
                  "\"c5\":%lu,\"r5\":%lu,"
                  "\"c6\":%lu,\"r6\":%lu,"
                  "\"c7\":%lu,\"r7\":%lu,"
                  "\"samples\":%lu,\"anomalies\":%lu,\"partials\":%lu}",
                  s_dma_channel_counts[0].load(std::memory_order_acquire),
                  s_dma_channel_last_raw[0].load(std::memory_order_acquire),
                  s_dma_channel_counts[1].load(std::memory_order_acquire),
                  s_dma_channel_last_raw[1].load(std::memory_order_acquire),
                  s_dma_channel_counts[2].load(std::memory_order_acquire),
                  s_dma_channel_last_raw[2].load(std::memory_order_acquire),
                  s_dma_channel_counts[3].load(std::memory_order_acquire),
                  s_dma_channel_last_raw[3].load(std::memory_order_acquire),
                  s_dma_channel_counts[4].load(std::memory_order_acquire),
                  s_dma_channel_last_raw[4].load(std::memory_order_acquire),
                  s_dma_channel_counts[5].load(std::memory_order_acquire),
                  s_dma_channel_last_raw[5].load(std::memory_order_acquire),
                  s_dma_channel_counts[6].load(std::memory_order_acquire),
                  s_dma_channel_last_raw[6].load(std::memory_order_acquire),
                  s_dma_channel_counts[7].load(std::memory_order_acquire),
                  s_dma_channel_last_raw[7].load(std::memory_order_acquire),
                  s_samples_read.load(std::memory_order_acquire),
                  s_channel_order_anomalies.load(std::memory_order_acquire),
                  s_partial_triples.load(std::memory_order_acquire));
    return std::string(json);
}


// handle for the ADC unit
static adc_oneshot_unit_handle_t adc1_handle = NULL;
static const char* TAG_COMMON = "HELPER_COMMON";
static float esp32_calibration(float value);

static void analog_oneshot_deinit() {
    if (adc1_handle == NULL) {
        return;
    }
    // ESP-IDF does not allow oneshot and continuous drivers to own ADC1 at the
    // same time, so mode changes must release the old driver first.
    adc_oneshot_del_unit(adc1_handle);
    adc1_handle = NULL;
}

void analog_init() {
    if (adc1_handle != NULL) {
        return;
    }
    
    ESP_LOGI(TAG_COMMON, "Initializing Analog Ports (ADC1)...");
    
    // init adc unit 1
    adc_oneshot_unit_init_cfg_t init_config1 = {
        .unit_id = ADC_UNIT_1,
        .clk_src = ADC_RTC_CLK_SRC_DEFAULT,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &adc1_handle));
    
    // configure channels
    adc_oneshot_chan_cfg_t config = {
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    
    // map channels
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_3, &config)); // AN1
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_5, &config)); // AN2
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_4, &config)); // AN3
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_7, &config)); // AN4
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_6, &config)); // AN5
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_0, &config)); // AN6

    for (uint32_t raw = 0; raw <= ANALOG_ADC_MAX_CODE; ++raw) {
        float voltage = ((float)raw / ADC_MAX) * VOLTAGE_MAX;
        s_calibration_lut[raw] = esp32_calibration(voltage);
    }
    s_calibration_lut_ready.store(true, std::memory_order_release);
    
    ESP_LOGI(TAG_COMMON, "Analog Ports Initialized.");
}

float calib_from[] = {0.00, 0.07, 0.17, 0.26, 0.36, 0.46, 0.56, 0.66, 0.76, 0.86, 0.96, 1.06, 1.16, 1.27, 1.37, 1.46, 1.56, 1.67, 1.76, 1.86, 1.96, 2.06, 2.16, 2.27, 2.37, 2.49, 2.61, 2.75, 2.90, 3.07, 3.26, 3.30, 3.30};
float calib_to[] = {0.10, 0.20, 0.30, 0.40, 0.50, 0.60, 0.70, 0.80, 0.90, 1.00, 1.10, 1.20, 1.30, 1.40, 1.50, 1.60, 1.70, 1.80, 1.90, 2.00, 2.10, 2.20, 2.30, 2.40, 2.50, 2.60, 2.70, 2.80, 2.90, 3.00, 3.10, 3.20, 3.30};
int calib_numel = sizeof(calib_from) / sizeof(calib_from[0]);

static float esp32_calibration(float value) {


