danielvie/doutorado/embedded/esp32_idf/main/src/helper_analog.cpp
    // lower boundary
    if (value <= calib_from[0]) {
        return calib_to[0];
    }

    // higher boundary
    if (value >= calib_from[calib_numel - 1]) {
        return calib_to[calib_numel - 1];
    }

    // find the lookup interval
    for (int i = 0; i < calib_numel - 1; ++i) {
        if (value >= calib_from[i] && value <= calib_from[i + 1]) {
            float x1 = calib_from[i];
            float y1 = calib_to[i];
            float x2 = calib_from[i + 1];
            float y2 = calib_to[i + 1];

            // perform a linear interpolation
            if (x2 == x1) {
                return y1;
            }

            return y1 + (value - x1) * (y2 - y1) / (x2 - x1);
        }
    }

    // edge cases protection
    return calib_to[calib_numel - 1];
}

float analog_calibrate_raw(uint32_t raw) {
    float voltage = ((float)raw / ADC_MAX) * VOLTAGE_MAX;
    return esp32_calibration(voltage);
}

float analog_calibrate_raw_lut(uint32_t raw) {
    if (raw > ANALOG_ADC_MAX_CODE) {
        raw = ANALOG_ADC_MAX_CODE;
    }
    if (!s_calibration_lut_ready.load(std::memory_order_acquire)) {
        return analog_calibrate_raw(raw);
    }
    return s_calibration_lut[raw];
}

static bool analog_port_to_channel(AnalogPort port, adc_channel_t* channel) {
    if (channel == nullptr) {
        return false;
    }

    switch (port) {
        case AnalogPort::AN1: *channel = ADC_CHANNEL_3; return true;
        case AnalogPort::AN2: *channel = ADC_CHANNEL_5; return true;
        case AnalogPort::AN3: *channel = ADC_CHANNEL_4; return true;
        case AnalogPort::AN4: *channel = ADC_CHANNEL_7; return true;
        case AnalogPort::AN5: *channel = ADC_CHANNEL_6; return true;
        case AnalogPort::AN6: *channel = ADC_CHANNEL_0; return true;
        default:
            return false;
    }
}

bool analog_read_port_sample(AnalogPort port, uint32_t* raw, float* calibrated) {
    if (adc1_handle == NULL) {
        ESP_LOGE(TAG_COMMON, "ADC not initialized! Call analog_init().");
        if (raw != nullptr) *raw = 0;
        if (calibrated != nullptr) *calibrated = -99.0f;
        return false;
    }
    
    adc_channel_t channel;
    if (!analog_port_to_channel(port, &channel)) {
        ESP_LOGW(TAG_COMMON, "Invalid Analog Port requested");
        if (raw != nullptr) *raw = 0;
        if (calibrated != nullptr) *calibrated = -99.0f;
        return false;
    }
    
    // read raw value
    int raw_val = 0;
    if (adc_oneshot_read(adc1_handle, channel, &raw_val) == ESP_OK) {
        if (raw != nullptr) *raw = (uint32_t)raw_val;
        if (calibrated != nullptr) *calibrated = analog_calibrate_raw((uint32_t)raw_val);
        return true;
    } else {
        ESP_LOGE(TAG_COMMON, "Failed to read ADC channel %d", channel);
        if (raw != nullptr) *raw = 0;
        if (calibrated != nullptr) *calibrated = -99.0f;
        return false;
    }
}

float analog_read_port(AnalogPort port) {
    float calibrated = -99.0f;
    analog_read_port_sample(port, nullptr, &calibrated);
    return calibrated;
}

static void analog_publish_compat(uint32_t raw_an3, float an3,
                                  uint32_t raw_an5, float an5,
                                  uint32_t raw_an6, float an6,
                                  uint64_t sample_timestamp_us,
                                  bool valid) {
    analog_publish_triple(raw_an3, an3, raw_an5, an5, raw_an6, an6,
                          sample_timestamp_us, valid);

    g_adc_an3.store(an3, std::memory_order_release);
    g_adc_an5.store(an5, std::memory_order_release);
    g_adc_an6.store(an6, std::memory_order_release);
    g_adc_fresh.store(valid, std::memory_order_release);
    g_system_state.ble_an_read_state.store(BLEAnalogReadState::IDLE, std::memory_order_release);
}

static void analog_continuous_stop() {
    if (s_adc_continuous_handle == NULL) {
        s_adc_continuous_started = false;
        s_adc_continuous_sample_hz = 0;
        return;
    }

    if (s_adc_continuous_started) {
        adc_continuous_stop(s_adc_continuous_handle);
        s_adc_continuous_started = false;
    }

    adc_continuous_deinit(s_adc_continuous_handle);
    s_adc_continuous_handle = NULL;
    s_adc_continuous_sample_hz = 0;
    s_adc_continuous_frames_since_delay = 0;
    analog_frame_ts_clear();
}

static bool analog_continuous_start(uint32_t sample_hz) {
    if (s_adc_continuous_started && s_adc_continuous_sample_hz == sample_hz) {
        return true;
    }

    analog_oneshot_deinit();
    analog_continuous_stop();

    adc_continuous_handle_cfg_t handle_config = {};
    handle_config.max_store_buf_size = ADC_CONTINUOUS_STORE_SIZE;
    handle_config.conv_frame_size = ADC_CONTINUOUS_FRAME_SIZE;
    // Prefer fresh data over backlog; old samples are worse than dropped ones
    // for closed-loop correction.
    handle_config.flags.flush_pool = 1;

    esp_err_t ret = adc_continuous_new_handle(&handle_config, &s_adc_continuous_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG_COMMON, "ADC continuous handle init failed: %s", esp_err_to_name(ret));
        s_adc_continuous_handle = NULL;
        return false;
    }

    // Hardware channels 4, 6, 0 are the board AN3, AN5, AN6 feedback inputs.
    adc_digi_pattern_config_t pattern[3] = {};
    pattern[0].atten = ADC_ATTEN_DB_12;
    pattern[0].channel = ADC_CHANNEL_4;
    pattern[0].unit = ADC_UNIT_1;
    pattern[0].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;
    pattern[1].atten = ADC_ATTEN_DB_12;
    pattern[1].channel = ADC_CHANNEL_6;
    pattern[1].unit = ADC_UNIT_1;
    pattern[1].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;
    pattern[2].atten = ADC_ATTEN_DB_12;
    pattern[2].channel = ADC_CHANNEL_0;
    pattern[2].unit = ADC_UNIT_1;
    pattern[2].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;

    adc_continuous_config_t adc_config = {};
    adc_config.pattern_num = 3;
    adc_config.adc_pattern = pattern;
    adc_config.sample_freq_hz = sample_hz;
    adc_config.conv_mode = ADC_CONV_SINGLE_UNIT_1;
    adc_config.format = ADC_CONTINUOUS_OUTPUT_FORMAT;

    ret = adc_continuous_config(s_adc_continuous_handle, &adc_config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG_COMMON, "ADC continuous config failed: %s", esp_err_to_name(ret));
        analog_continuous_stop();
        return false;
    }

