danielvie/doutorado/embedded/esp32_idf/main/src/helper_analog.cpp
    // Frame timestamps come from the conversion-done ISR so measurement age
    // reflects sampling time, not acquisition-task scheduling.
    adc_continuous_evt_cbs_t evt_cbs = {};
    evt_cbs.on_conv_done = analog_on_conv_done;
    ret = adc_continuous_register_event_callbacks(s_adc_continuous_handle, &evt_cbs, NULL);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG_COMMON, "ADC continuous callback registration failed: %s", esp_err_to_name(ret));
        analog_continuous_stop();
        return false;
    }

    analog_frame_ts_clear();
    ret = adc_continuous_start(s_adc_continuous_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG_COMMON, "ADC continuous start failed: %s", esp_err_to_name(ret));
        analog_continuous_stop();
        return false;
    }

    s_adc_continuous_started = true;
    s_adc_continuous_sample_hz = sample_hz;
    ESP_LOGI(TAG_COMMON, "ADC continuous started at %lu samples/s", sample_hz);
    return true;
}

struct AnalogTripleAccumulator {
    uint32_t raw[3][ANALOG_DMA_CHANNEL_QUEUE_SIZE] = {};
    uint64_t ts_us[3][ANALOG_DMA_CHANNEL_QUEUE_SIZE] = {};
    uint8_t head[3] = {};
    uint8_t tail[3] = {};
    uint8_t count[3] = {};
};

static void analog_reset_partial_triple(AnalogTripleAccumulator* acc) {
    for (uint32_t i = 0; i < 3; ++i) {
        acc->head[i] = 0;
        acc->tail[i] = 0;
        acc->count[i] = 0;
    }
}

static bool analog_channel_to_queue_index(uint32_t channel, uint32_t* index) {
    switch (channel) {
    case ADC_CHANNEL_4:
        *index = 0;
        return true;
    case ADC_CHANNEL_6:
        *index = 1;
        return true;
    case ADC_CHANNEL_0:
        *index = 2;
        return true;
    default:
        return false;
    }
}

static void analog_queue_push(AnalogTripleAccumulator* acc, uint32_t index,
                              uint32_t raw, uint64_t ts_us) {
    if (acc->count[index] == ANALOG_DMA_CHANNEL_QUEUE_SIZE) {
        // Channel imbalance means the queues no longer describe the same
        // conversion rounds; pairing them would feed the gain matrix samples
        // taken far apart as if simultaneous. Flush everything and restart
        // triple assembly from coherent data.
        analog_reset_partial_triple(acc);
        s_channel_order_anomalies.fetch_add(1, std::memory_order_acq_rel);
        s_partial_triples.fetch_add(1, std::memory_order_acq_rel);
    }

    acc->raw[index][acc->tail[index]] = raw;
    acc->ts_us[index][acc->tail[index]] = ts_us;
    acc->tail[index] = (acc->tail[index] + 1) % ANALOG_DMA_CHANNEL_QUEUE_SIZE;
    acc->count[index]++;
}

static uint32_t analog_queue_pop(AnalogTripleAccumulator* acc, uint32_t index,
                                 uint64_t* ts_us) {
    uint32_t raw = acc->raw[index][acc->head[index]];
    *ts_us = acc->ts_us[index][acc->head[index]];
    acc->head[index] = (acc->head[index] + 1) % ANALOG_DMA_CHANNEL_QUEUE_SIZE;
    acc->count[index]--;
    return raw;
}

// Drains all complete triples but publishes only the newest one: the control
// point only ever consumes the latest snapshot, so writing every triple is
// wasted seqlock traffic. Skipped triples still count toward the rate metric.
static void analog_publish_queued_triples(AnalogTripleAccumulator* acc) {
    bool have_triple = false;
    uint32_t raw_an3 = 0, raw_an5 = 0, raw_an6 = 0;
    uint64_t triple_ts_us = 0;

    while (acc->count[0] > 0 && acc->count[1] > 0 && acc->count[2] > 0) {
        if (have_triple) {
            analog_rate_record_triple((uint64_t)esp_timer_get_time());
        }
        uint64_t ts_an3, ts_an5, ts_an6;
        raw_an3 = analog_queue_pop(acc, 0, &ts_an3);
        raw_an5 = analog_queue_pop(acc, 1, &ts_an5);
        raw_an6 = analog_queue_pop(acc, 2, &ts_an6);
        // Oldest of the three: the conservative age for the assembled triple.
        triple_ts_us = ts_an3;
        if (ts_an5 < triple_ts_us) triple_ts_us = ts_an5;
        if (ts_an6 < triple_ts_us) triple_ts_us = ts_an6;
        have_triple = true;
    }

    if (have_triple) {
        analog_publish_compat(raw_an3, analog_calibrate_raw_lut(raw_an3),
                              raw_an5, analog_calibrate_raw_lut(raw_an5),
                              raw_an6, analog_calibrate_raw_lut(raw_an6),
                              triple_ts_us, true);
    }
}

static void analog_continuous_accept_sample(AnalogTripleAccumulator* acc, uint32_t channel,
                                            uint32_t raw, uint64_t ts_us) {
    s_samples_read.fetch_add(1, std::memory_order_acq_rel);
    if (channel < 8) {
        s_dma_channel_counts[channel].fetch_add(1, std::memory_order_acq_rel);
        s_dma_channel_last_raw[channel].store(raw, std::memory_order_release);
    }

    uint32_t index;
    if (!analog_channel_to_queue_index(channel, &index)) {
        s_samples_rejected.fetch_add(1, std::memory_order_acq_rel);
        return;
    }

    analog_queue_push(acc, index, raw, ts_us);
}

static void analog_oneshot_step() {
    analog_init();

    float an3, an5, an6;
    uint32_t raw_an3, raw_an5, raw_an6;

    // Timestamp before the first conversion: the oldest plausible sample time
    // for the triple, so measurement age is never underestimated.
    uint64_t sample_ts_us = (uint64_t)esp_timer_get_time();
    uint32_t start = esp_cpu_get_cycle_count();
    bool valid = analog_read_port_sample(AnalogPort::AN3, &raw_an3, &an3);
    valid = analog_read_port_sample(AnalogPort::AN5, &raw_an5, &an5) && valid;
    valid = analog_read_port_sample(AnalogPort::AN6, &raw_an6, &an6) && valid;
    uint32_t end = esp_cpu_get_cycle_count();
    analog_record_latency((end - start) / esp_rom_get_cpu_ticks_per_us());
    analog_publish_compat(raw_an3, an3, raw_an5, an5, raw_an6, an6, sample_ts_us, valid);

    uint32_t period_us = g_analog_acquisition_period_us;
    if (period_us >= 1000) {
        vTaskDelay(pdMS_TO_TICKS((period_us + 999) / 1000));
    } else if (period_us > 0) {
        esp_rom_delay_us(period_us);
    } else {
        taskYIELD();
    }
}

static void analog_continuous_step(AnalogTripleAccumulator* acc) {
    uint32_t sample_hz = g_analog_continuous_sample_hz;
    if (!analog_continuous_start(sample_hz)) {
        analog_record_overflow();
        g_analog_acquisition_mode = ANALOG_ACQ_MODE_ONESHOT;
        analog_reset_partial_triple(acc);
        vTaskDelay(pdMS_TO_TICKS(100));
        return;
    }

    uint8_t frame[ADC_CONTINUOUS_FRAME_SIZE];
    uint32_t out_len = 0;
    uint32_t start = esp_cpu_get_cycle_count();
    esp_err_t ret = adc_continuous_read(s_adc_continuous_handle, frame, sizeof(frame), &out_len, 20);
    uint32_t end = esp_cpu_get_cycle_count();

