danielvie/doutorado/embedded/esp32_idf/main/src/helper_analog.cpp
    if (ret == ESP_ERR_TIMEOUT) {
        return;
    }
    if (ret != ESP_OK) {
        analog_record_overflow();
        s_frame_drops.fetch_add(1, std::memory_order_acq_rel);
        analog_reset_partial_triple(acc);
        analog_frame_ts_clear();
        if (ret == ESP_ERR_INVALID_STATE) {
            s_pool_flushes.fetch_add(1, std::memory_order_acq_rel);
            adc_continuous_flush_pool(s_adc_continuous_handle);
        } else {
            ESP_LOGW(TAG_COMMON, "ADC continuous read failed: %s", esp_err_to_name(ret));
        }
        return;
    }

    analog_record_latency((end - start) / esp_rom_get_cpu_ticks_per_us());
    if (out_len % SOC_ADC_DIGI_RESULT_BYTES != 0) {
        s_samples_rejected.fetch_add(1, std::memory_order_acq_rel);
    }

    uint64_t now_us = (uint64_t)esp_timer_get_time();
    uint64_t frame_ts_us = analog_frame_ts_pop(now_us);
    uint32_t total_samples = out_len / SOC_ADC_DIGI_RESULT_BYTES;
    if (out_len != sizeof(frame)) {
        // Partial frame: the ISR timestamp pairing no longer lines up with
        // reads, so resync and fall back to read time for this frame.
        analog_frame_ts_clear();
        frame_ts_us = now_us;
    }

    for (uint32_t i = 0, sample_index = 0; i + SOC_ADC_DIGI_RESULT_BYTES <= out_len;
         i += SOC_ADC_DIGI_RESULT_BYTES, ++sample_index) {
        adc_digi_output_data_t* sample = reinterpret_cast<adc_digi_output_data_t*>(&frame[i]);
        // Backdate each sample from the frame-completion time using its
        // position in the frame and the configured conversion rate.
        uint64_t sample_ts_us = frame_ts_us;
        if (sample_hz > 0 && total_samples > 0) {
            sample_ts_us -= ((uint64_t)(total_samples - 1 - sample_index) * 1000000ULL) / sample_hz;
        }
        analog_continuous_accept_sample(acc, ADC_CONTINUOUS_GET_CHANNEL(sample),
                                        ADC_CONTINUOUS_GET_DATA(sample), sample_ts_us);
    }
    analog_publish_queued_triples(acc);
    s_adc_continuous_frames_since_delay++;
    if (s_adc_continuous_frames_since_delay >= ADC_CONTINUOUS_FRAMES_PER_IDLE_DELAY) {
        s_adc_continuous_frames_since_delay = 0;
        vTaskDelay(1);
    } else {
        taskYIELD();
    }
}

void analog_acquisition_task(void* arg) {
    ESP_LOGI(TAG_COMMON, "Analog Background Acquisition Task Started");
    // Static: the per-channel timestamp queues are too large for the 4 KB
    // task stack, and only one acquisition task ever exists.
    static AnalogTripleAccumulator acc;

    for (;;) {
        if (g_analog_acquisition_mode == ANALOG_ACQ_MODE_CONTINUOUS) {
            analog_continuous_step(&acc);
        } else {
            analog_continuous_stop();
            analog_reset_partial_triple(&acc);
            analog_oneshot_step();
        }
    }
}
